; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 2976)
	(= (fuel plane1) 312)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at plane2 city3)
	(= (capacity plane2) 5193)
	(= (fuel plane2) 1057)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 7)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 6)
	(at plane3 city2)
	(= (capacity plane3) 4525)
	(= (fuel plane3) 174)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 4)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 7)
	(at plane4 city3)
	(= (capacity plane4) 9648)
	(= (fuel plane4) 1239)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 13)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 1)
	(at plane5 city3)
	(= (capacity plane5) 14204)
	(= (fuel plane5) 4369)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 14)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 1)
	(at person1 city3)
	(at person2 city3)
	(at person3 city3)
	(at person4 city2)
	(at person5 city2)
	(at person6 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 939)
	(= (distance city0 city2) 872)
	(= (distance city0 city3) 958)
	(= (distance city1 city0) 939)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 735)
	(= (distance city1 city3) 553)
	(= (distance city2 city0) 872)
	(= (distance city2 city1) 735)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 815)
	(= (distance city3 city0) 958)
	(= (distance city3 city1) 553)
	(= (distance city3 city2) 815)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city2)
	(at plane5 city3)
	(at person1 city2)
	(at person2 city2)
	(at person3 city0)
	(at person4 city3)
	(at person5 city0)
	))

(:metric minimize (+ (* 1 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (refuel plane2 city3)
   changed: (fuel plane2) from 1057 to 5193
   goals met: 1 of 7
2. (board person4 plane1 city2)
   deleted: (at person4 city2)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 7
3. (refuel plane1 city2)
   changed: (fuel plane1) from 312 to 2976
   goals met: 1 of 7
4. (board person1 plane2 city3)
   deleted: (at person1 city3)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 7
5. (board person3 plane2 city3)
   deleted: (at person3 city3)
   added: (in person3 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 1 of 7
6. (fly plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 0 to 1630, (fuel plane2) from 5193 to 3563
   goals met: 2 of 7
7. (debark person1 plane2 city2)
   deleted: (in person1 plane2)
   added: (at person1 city2)
   changed: (onboard plane2) from 2 to 1
   goals met: 3 of 7
8. (board person2 plane5 city3)
   deleted: (at person2 city3)
   added: (in person2 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 3 of 7
9. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 1630 to 2445, (fuel plane1) from 2976 to 2161
   goals met: 3 of 7
10. (debark person4 plane1 city3)
   deleted: (in person4 plane1)
   added: (at person4 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 7
11. (board person5 plane2 city2)
   deleted: (at person5 city2)
   added: (in person5 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 4 of 7
12. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 2445 to 4189, (fuel plane2) from 3563 to 1819
   goals met: 3 of 7
13. (debark person3 plane2 city0)
   deleted: (in person3 plane2)
   added: (at person3 city0)
   changed: (onboard plane2) from 2 to 1
   goals met: 4 of 7
14. (debark person5 plane2 city0)
   deleted: (in person5 plane2)
   added: (at person5 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 5 of 7
15. (fly plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 4189 to 5933, (fuel plane2) from 1819 to 75
   goals met: 6 of 7
16. (fly plane5 city3 city2)
   deleted: (at plane5 city3)
   added: (at plane5 city2)
   changed: (total-fuel-used) from 5933 to 10008, (fuel plane5) from 4369 to 294
   goals met: 5 of 7
17. (debark person2 plane5 city2)
   deleted: (in person2 plane5)
   added: (at person2 city2)
   changed: (onboard plane5) from 1 to 0
   goals met: 6 of 7
18. (refuel plane5 city2)
   changed: (fuel plane5) from 294 to 14204
   goals met: 6 of 7
19. (fly plane5 city2 city3)
   deleted: (at plane5 city2)
   added: (at plane5 city3)
   changed: (total-fuel-used) from 10008 to 14083, (fuel plane5) from 14204 to 10129
   goals met: 7 of 7
